[
  {
    "nickname": "Superman",
    "real_name": "Clark Kent",
    "origin_description": "he was born Kal-El on the planet Krypton, before being rocketed to Earth as an infant by his scientist father Jor-El, moments before Krypton's destruction…",
    "superpowers": "solar energy absorption and healing factor, solar flare and heat vision, solar invulnerability, flight…",
    "catch_phrase": "“Look, up in the sky, it's a bird, it's a plane, it's Superman!",
    "Images": "a set of images of the superhero"
  },
  {
    "nickname": "Spider-Man",
    "real_name": "Peter Parker",
    "origin_description": "Peter Parker was bitten by a radioactive spider during a high school science experiment, which granted him the proportionate strength, speed, and agility of a spider. He uses his abilities to fight crime in New York City as Spider-Man.",
    "superpowers": "enhanced strength, speed, and agility, ability to stick to walls and ceilings, spider-sense (precognitive ability to sense danger), web-slinging and web-based gadgets",
    "catch_phrase": "“With great power comes great responsibility.”",
    "images": "a set of images of the superhero"
  },
  {
    "nickname": "Wonder Woman",
    "real_name": "Diana Prince",
    "origin_description": "Diana Prince is an Amazon princess who was raised on the island of Themyscira. She possesses superhuman powers bestowed upon her by the gods of Olympus. She ventures into the world of men as Wonder Woman to fight for justice and peace.",
    "superpowers": "superhuman strength and durability, enhanced speed and reflexes, flight, truth-telling Lasso of Truth, bracelets that deflect projectiles",
    "catch_phrase": "“It's not about deserve, it's about what you believe. And I believe in love.”",
    "Images": "a set of images of the superhero"
  },
  {
    "nickname": "Iron Man",
    "real_name": "Tony Stark",
    "origin_description": "Tony Stark is a genius billionaire inventor and business magnate. After being critically injured, he creates a powered suit of armor to save his own life and becomes the armored superhero known as Iron Man.",
    "superpowers": "high-tech suit of armor with enhanced strength, flight, repulsor beams, missiles, and advanced weaponry, genius-level intellect",
    "catch_phrase": "“I am Iron Man.”",
    "Images": "a set of images of the superhero"
  }
]
